benchmarks/results/20260725_vps_onbox/caddy_static_gzip_c500.txt
Running 15s test @ http://127.0.0.1:8080/small.txt
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.18ms   58.87ms 508.93ms   81.87%
    Req/Sec     7.04k   674.37     8.65k    65.33%
  Latency Distribution
     50%   42.81ms
     75%   89.39ms
     90%  145.21ms
     99%  205.00ms
  210111 requests in 15.03s, 116.62MB read
Requests/sec:  13983.86
Transfer/sec:      7.76MB