benchmarks/results/20260725_vps_onbox/nginx_proxy_c200.txt
Running 15s test @ http://127.0.0.1:8080/proxy/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.59ms    3.02ms  39.66ms   65.93%
    Req/Sec    10.44k   748.02    12.18k    63.33%
  Latency Distribution
     50%    9.55ms
     75%   11.24ms
     90%   14.03ms
     99%   16.88ms
  312032 requests in 15.02s, 60.11MB read
Requests/sec:  20777.83
Transfer/sec:      4.00MB