benchmarks/results/20260725_vps_onbox/nginx_static_plain_c50.txt
Running 15s test @ http://127.0.0.1:8080/small.txt
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  600.86us   6.20ms   66.52%
    Req/Sec    26.09k     1.17k   28.65k    62.00%
  Latency Distribution
     50%  848.00us
     75%    1.31ms
     90%    1.76ms
     99%    2.74ms
  779260 requests in 15.01s, 0.92GB read
Requests/sec:  51904.25
Transfer/sec:     63.01MB