benchmarks/results/20260725_vps_onbox/pingclair_static_gzip_c500.txt
Running 15s test @ http://127.0.0.1:8080/small.txt
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.46ms    4.83ms  36.71ms   71.89%
    Req/Sec    12.90k   431.78    13.69k    82.67%
  Latency Distribution
     50%   21.49ms
     75%   22.24ms
     90%   23.18ms
     99%   26.70ms
  385089 requests in 15.02s, 212.27MB read
Requests/sec:  25642.26
Transfer/sec:     14.13MB