benchmarks/results/20260725_vps_onbox/pingclair_static_plain_c50.txt
Running 15s test @ http://127.0.0.1:8080/small.txt
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.49ms  707.94us  13.29ms   72.22%
    Req/Sec    10.06k   756.39    11.38k    71.33%
  Latency Distribution
     50%    2.48ms
     75%    2.91ms
     90%    3.31ms
     99%    4.36ms
  300344 requests in 15.00s, 359.76MB read
Requests/sec:  20022.18
Transfer/sec:     23.98MB